/* 
/*****（一）将n划分成若干不同整数之和的划分数************ 
   dp[i][j]表示将整数i划分成不超过j的划分数，分含不含j两种情况 
   dp[0][0] = 1 
   dp[i][j] = dp[i-j][j-1] + dp[i][j-1];(j<=i) 
            = dp[i][i]                (j >i) 
   =>ans = dp[n][n] 
 
/*****（二）将n划分成若干正整数之和的划分数************* 
   dp[i][j]表示将整数i划分成不超过j的划分数，分含不含j两种情况 
   与（一）区别，j可重复 
   dp[0][0] = 1 
   dp[i][j] = dp[i-j][j] + dp[i][j-1];(j<=i) 
            = dp[i][i]                (j >i) 
   =>ans = dp[n][n] 
 
/*****（三）将n划分成k个正整数之和的划分数************* 
   dp[i][j]表示将整数i划分成j个正整数的划分数，考虑j组数中含不含1 
   dp[0][0] = 1 
   dp[i][j] = dp[i-1][j-1] + dp[i-j][j]; 
   如果不包含1，那么每组数至少为2，从每堆数中各拿出1还能够成j堆数dp[i-j][j] 
   =>ans = dp[n][k] 
/*****（四）将n划分成最大数不超过k的划分数************ 
   dp[i][j]表示将整数i划分成不超过j的划分数，分含不含j两种情况 
   是（二）的特例 
   dp[0][0] = 1 
   dp[i][j] = dp[i-j][j] + dp[i][j-1];(j<=i) 
            = dp[i][i]                (j >i) 
   =>ans = dp[n][k] 
/*****（五）将n划分成若干个 奇正整数之和的划分数****** 
   dp[i][j]表示将整数i划分成不超过j的划分数，分含不含j两种情况 
   dp[0][0] = 1; 
   j是奇数，正常判断 
                     dp[i][j] = dp[i-j][j] + dp[i][j-1];(j<=i) 
                              = dp[i][i]                (j >i) 
   j是偶数,dp[i][j] = dp[i][j-1]//往下递推 
   =>ans = dp[n][n] 
*/  
